---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetRodInfo
source: html/d1b925eb-9fde-0c61-e416-25b4e98a8fd4.htm
---
# Autodesk.Revit.DB.FabricationPart.GetRodInfo Method

Gets the fabrication rod information.

## Syntax (C#)
```csharp
public FabricationRodInfo GetRodInfo()
```

## Returns
The fabrication rod information. Returns null if the fabrication part does not have any rod.